7767517
269 311
Input            input                    0 1 input
YoloV5Focus              focus                    1 1 data 622
Convolution      Conv_41                  1 1 622 1785 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
HardSwish        Div_48                   1 1 1785 633 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_49                  1 1 633 1788 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
HardSwish        Div_56                   1 1 1788 644 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_57                  1 1 644 1791 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
HardSwish        Div_64                   1 1 1791 655 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 655 655_splitncnn_0 655_splitncnn_1
Convolution      Conv_65                  1 1 655_splitncnn_1 1794 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
HardSwish        Div_72                   1 1 1794 666 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_73                  1 1 655_splitncnn_0 1797 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
HardSwish        Div_80                   1 1 1797 677 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_1              1 2 677 677_splitncnn_0 677_splitncnn_1
Convolution      Conv_81                  1 1 677_splitncnn_1 1800 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
HardSwish        Div_88                   1 1 1800 688 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_89                  1 1 688 1803 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
HardSwish        Div_96                   1 1 1803 699 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_97                  1 1 699 1806 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
HardSwish        Div_104                  1 1 1806 710 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_105                  2 1 710 677_splitncnn_0 711 0=0
Concat           Concat_106               2 1 711 666 712 0=0
Convolution      Conv_107                 1 1 712 1809 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_114                  1 1 1809 723 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_115                 1 1 723 1812 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_122                  1 1 1812 734 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_123                 1 1 734 1815 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
HardSwish        Div_130                  1 1 1815 745 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_2              1 2 745 745_splitncnn_0 745_splitncnn_1
Convolution      Conv_131                 1 1 745_splitncnn_1 1818 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
HardSwish        Div_138                  1 1 1818 756 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_139                 1 1 745_splitncnn_0 1821 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
HardSwish        Div_146                  1 1 1821 767 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_3              1 2 767 767_splitncnn_0 767_splitncnn_1
Convolution      Conv_147                 1 1 767_splitncnn_1 1824 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_154                  1 1 1824 778 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_155                 1 1 778 1827 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_162                  1 1 1827 789 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_163                 1 1 789 1830 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_170                  1 1 1830 800 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_171                  2 1 800 767_splitncnn_0 801 0=0
Split            splitncnn_4              1 2 801 801_splitncnn_0 801_splitncnn_1
Convolution      Conv_172                 1 1 801_splitncnn_1 1833 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_179                  1 1 1833 812 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_180                 1 1 812 1836 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_187                  1 1 1836 823 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_188                 1 1 823 1839 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_195                  1 1 1839 834 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_196                  2 1 834 801_splitncnn_0 835 0=0
Split            splitncnn_5              1 2 835 835_splitncnn_0 835_splitncnn_1
Convolution      Conv_197                 1 1 835_splitncnn_1 1842 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_204                  1 1 1842 846 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_205                 1 1 846 1845 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_212                  1 1 1845 857 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_213                 1 1 857 1848 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_220                  1 1 1848 868 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_221                  2 1 868 835_splitncnn_0 869 0=0
Concat           Concat_222               2 1 869 756 870 0=0
Convolution      Conv_223                 1 1 870 1851 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_230                  1 1 1851 881 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_6              1 2 881 881_splitncnn_0 881_splitncnn_1
ConvolutionDepthWise Conv_231                 1 1 881_splitncnn_1 1854 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_238                  1 1 1854 892 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_239                 1 1 892 1857 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
HardSwish        Div_246                  1 1 1857 903 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_7              1 2 903 903_splitncnn_0 903_splitncnn_1
Convolution      Conv_247                 1 1 903_splitncnn_1 1860 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
HardSwish        Div_254                  1 1 1860 914 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_255                 1 1 903_splitncnn_0 1863 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
HardSwish        Div_262                  1 1 1863 925 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_8              1 2 925 925_splitncnn_0 925_splitncnn_1
Convolution      Conv_263                 1 1 925_splitncnn_1 1866 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_270                  1 1 1866 936 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_271                 1 1 936 1869 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_278                  1 1 1869 947 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_279                 1 1 947 1872 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_286                  1 1 1872 958 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_287                  2 1 958 925_splitncnn_0 959 0=0
Split            splitncnn_9              1 2 959 959_splitncnn_0 959_splitncnn_1
Convolution      Conv_288                 1 1 959_splitncnn_1 1875 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_295                  1 1 1875 970 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_296                 1 1 970 1878 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_303                  1 1 1878 981 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_304                 1 1 981 1881 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_311                  1 1 1881 992 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_312                  2 1 992 959_splitncnn_0 993 0=0
Split            splitncnn_10             1 2 993 993_splitncnn_0 993_splitncnn_1
Convolution      Conv_313                 1 1 993_splitncnn_1 1884 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_320                  1 1 1884 1004 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_321                 1 1 1004 1887 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_328                  1 1 1887 1015 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_329                 1 1 1015 1890 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_336                  1 1 1890 1026 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_337                  2 1 1026 993_splitncnn_0 1027 0=0
Concat           Concat_338               2 1 1027 914 1028 0=0
Convolution      Conv_339                 1 1 1028 1893 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_346                  1 1 1893 1039 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_11             1 2 1039 1039_splitncnn_0 1039_splitncnn_1
ConvolutionDepthWise Conv_347                 1 1 1039_splitncnn_1 1896 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
HardSwish        Div_354                  1 1 1896 1050 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_355                 1 1 1050 1899 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_362                  1 1 1899 1061 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_363                 1 1 1061 1902 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_370                  1 1 1902 1072 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_12             1 4 1072 1072_splitncnn_0 1072_splitncnn_1 1072_splitncnn_2 1072_splitncnn_3
Pooling          MaxPool_371              1 1 1072_splitncnn_3 1073 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Pooling          MaxPool_372              1 1 1072_splitncnn_2 1074 0=0 1=9 11=9 2=1 12=1 3=4 13=4 14=4 15=4 5=1
Pooling          MaxPool_373              1 1 1072_splitncnn_1 1075 0=0 1=13 11=13 2=1 12=1 3=6 13=6 14=6 15=6 5=1
Concat           Concat_374               4 1 1072_splitncnn_0 1073 1074 1075 1076 0=0
Convolution      Conv_375                 1 1 1076 1905 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
HardSwish        Div_382                  1 1 1905 1087 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_13             1 2 1087 1087_splitncnn_0 1087_splitncnn_1
Convolution      Conv_383                 1 1 1087_splitncnn_1 1908 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_390                  1 1 1908 1098 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_391                 1 1 1087_splitncnn_0 1911 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_398                  1 1 1911 1109 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_399                 1 1 1109 1914 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_406                  1 1 1914 1120 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_407                 1 1 1120 1917 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
HardSwish        Div_414                  1 1 1917 1131 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_415                 1 1 1131 1920 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_422                  1 1 1920 1142 0=1.666667e-01 1=5.000000e-01
Concat           Concat_423               2 1 1142 1098 1143 0=0
Convolution      Conv_424                 1 1 1143 1923 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
HardSwish        Div_431                  1 1 1923 1154 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_432                 1 1 881_splitncnn_0 1926 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_439                  1 1 1926 1165 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_440                 1 1 1039_splitncnn_0 1929 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
HardSwish        Div_447                  1 1 1929 1176 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_448                 1 1 1154 1932 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_455                  1 1 1932 1187 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_14             1 3 1187 1187_splitncnn_0 1187_splitncnn_1 1187_splitncnn_2
Interp           Resize_457               1 1 1187_splitncnn_2 1192 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_458               2 1 1192 1176 1193 0=0
Split            splitncnn_15             1 2 1193 1193_splitncnn_0 1193_splitncnn_1
Convolution      Conv_459                 1 1 1193_splitncnn_1 1935 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_466                  1 1 1935 1204 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_467                 1 1 1193_splitncnn_0 1938 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_474                  1 1 1938 1215 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_475                 1 1 1215 1941 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_482                  1 1 1941 1226 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_483                 1 1 1226 1944 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_490                  1 1 1944 1237 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_491                 1 1 1237 1947 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_498                  1 1 1947 1248 0=1.666667e-01 1=5.000000e-01
Concat           Concat_499               2 1 1248 1204 1249 0=0
Convolution      Conv_500                 1 1 1249 1950 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_507                  1 1 1950 1260 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_16             1 2 1260 1260_splitncnn_0 1260_splitncnn_1
Interp           Resize_509               1 1 1260_splitncnn_1 1265 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_510               2 1 1265 1165 1266 0=0
Split            splitncnn_17             1 2 1266 1266_splitncnn_0 1266_splitncnn_1
Convolution      Conv_511                 1 1 1266_splitncnn_1 1953 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_518                  1 1 1953 1277 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_519                 1 1 1266_splitncnn_0 1956 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_526                  1 1 1956 1288 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_527                 1 1 1288 1959 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_534                  1 1 1959 1299 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_535                 1 1 1299 1962 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_542                  1 1 1962 1310 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_543                 1 1 1310 1965 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_550                  1 1 1965 1321 0=1.666667e-01 1=5.000000e-01
Concat           Concat_551               2 1 1321 1277 1322 0=0
Convolution      Conv_552                 1 1 1322 1968 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_559                  1 1 1968 1333 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_18             1 2 1333 1333_splitncnn_0 1333_splitncnn_1
ConvolutionDepthWise Conv_560                 1 1 1333_splitncnn_1 1334 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_567                  1 1 1334 1343 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_568                 1 1 1343 1344 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_575                  1 1 1344 1353 0=1.666667e-01 1=5.000000e-01
Concat           Concat_576               2 1 1353 1260_splitncnn_0 1354 0=0
Split            splitncnn_19             1 2 1354 1354_splitncnn_0 1354_splitncnn_1
Convolution      Conv_577                 1 1 1354_splitncnn_1 1971 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_584                  1 1 1971 1365 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_585                 1 1 1354_splitncnn_0 1974 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_592                  1 1 1974 1376 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_593                 1 1 1376 1977 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_600                  1 1 1977 1387 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_601                 1 1 1387 1980 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_608                  1 1 1980 1398 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_609                 1 1 1398 1983 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_616                  1 1 1983 1409 0=1.666667e-01 1=5.000000e-01
Concat           Concat_617               2 1 1409 1365 1410 0=0
Convolution      Conv_618                 1 1 1410 1986 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_625                  1 1 1986 1421 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_20             1 2 1421 1421_splitncnn_0 1421_splitncnn_1
ConvolutionDepthWise Conv_626                 1 1 1421_splitncnn_1 1422 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_633                  1 1 1422 1431 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_634                 1 1 1431 1432 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_641                  1 1 1432 1441 0=1.666667e-01 1=5.000000e-01
Concat           Concat_642               2 1 1441 1187_splitncnn_1 1442 0=0
Split            splitncnn_21             1 2 1442 1442_splitncnn_0 1442_splitncnn_1
Convolution      Conv_643                 1 1 1442_splitncnn_1 1989 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_650                  1 1 1989 1453 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_651                 1 1 1442_splitncnn_0 1992 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_658                  1 1 1992 1464 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_659                 1 1 1464 1995 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_666                  1 1 1995 1475 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_667                 1 1 1475 1998 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        Div_674                  1 1 1998 1486 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_675                 1 1 1486 2001 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_682                  1 1 2001 1497 0=1.666667e-01 1=5.000000e-01
Concat           Concat_683               2 1 1497 1453 1498 0=0
Convolution      Conv_684                 1 1 1498 2004 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_691                  1 1 2004 1509 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_22             1 2 1509 1509_splitncnn_0 1509_splitncnn_1
ConvolutionDepthWise Conv_692                 1 1 1187_splitncnn_0 2007 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_699                  1 1 2007 1520 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_700                 1 1 1520 2010 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_707                  1 1 2010 1531 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_708                 1 1 1509_splitncnn_1 2013 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_715                  1 1 2013 1542 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_716                 1 1 1542 2016 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_723                  1 1 2016 1553 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_724                  2 1 1531 1553 1554 0=0
ConvolutionDepthWise Conv_725                 1 1 1333_splitncnn_0 2019 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_732                  1 1 2019 1565 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_733                 1 1 1565 2022 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_740                  1 1 2022 1576 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_741                 1 1 1576 2025 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_748                  1 1 2025 1587 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_749                 1 1 1587 2028 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_756                  1 1 2028 1598 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_757                 1 1 1598 1599 0=33 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
Slice            Split_758                1 2 1599 1600 1601 -23300=2,1,-233 1=0
Sigmoid          Sigmoid_759              1 1 1600 1602
Concat           Concat_760               2 1 1602 1601 1603 0=0
Reshape          Reshape_768              1 1 1603 1611 0=-1 1=33
ConvolutionDepthWise Conv_769                 1 1 1421_splitncnn_0 2031 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_776                  1 1 2031 1622 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_777                 1 1 1622 2034 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_784                  1 1 2034 1633 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_785                 1 1 1633 2037 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_792                  1 1 2037 1644 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_793                 1 1 1644 2040 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_800                  1 1 2040 1655 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_801                 1 1 1655 1656 0=33 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
Slice            Split_802                1 2 1656 1657 1658 -23300=2,1,-233 1=0
Sigmoid          Sigmoid_803              1 1 1657 1659
Concat           Concat_804               2 1 1659 1658 1660 0=0
Reshape          Reshape_812              1 1 1660 1668 0=-1 1=33
ConvolutionDepthWise Conv_813                 1 1 1509_splitncnn_0 2043 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_820                  1 1 2043 1679 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_821                 1 1 1679 2046 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_828                  1 1 2046 1690 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_829                 1 1 1690 2049 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_836                  1 1 2049 1701 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_837                 1 1 1701 2052 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_844                  1 1 2052 1712 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_845                 1 1 1712 1713 0=33 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
Slice            Split_846                1 2 1713 1714 1715 -23300=2,1,-233 1=0
Sigmoid          Sigmoid_847              1 1 1714 1716
Concat           Concat_848               2 1 1716 1715 1717 0=0
Reshape          Reshape_856              1 1 1717 1725 0=-1 1=33
ConvolutionDepthWise Conv_857                 1 1 1554 2055 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_864                  1 1 2055 1736 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_865                 1 1 1736 2058 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_872                  1 1 2058 1747 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_873                 1 1 1747 2061 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
HardSwish        Div_880                  1 1 2061 1758 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_881                 1 1 1758 2064 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_888                  1 1 2064 1769 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_889                 1 1 1769 1770 0=33 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
Slice            Split_890                1 2 1770 1771 1772 -23300=2,1,-233 1=0
Sigmoid          Sigmoid_891              1 1 1771 1773
Concat           Concat_892               2 1 1773 1772 1774 0=0
Reshape          Reshape_900              1 1 1774 1782 0=-1 1=33
Concat           Concat_901               4 1 1611 1668 1725 1782 1783 0=1
Permute          Transpose_902            1 1 1783 output 0=1
